In [1]:
__author__ = 'Knut Olsen <knut.olsen@noirlab.edu>, Mike Fitzpatrick <mike.fitzpatrick@noirlab.edu>, Adam Scott <adam.scott@noirlab.edu>'
__version__ = '20230726' # yyyymmdd
__datasets__ = ['usno.a2', 'gaia_dr3']
__keywords__ = ['crossmatch', 'mydb', 'query', 'tutorial', 'vospace']

# How to do an efficient crossmatch of a user table with a table in Data Lab
*Knut Olsen, Mike Fitzpatrick, and Adam Scott*

# Table of Contents
* [Goals](#goals)
* [Summary](#summary)
* [Disclaimer & attribution](#attribution)
* [Standard Imports and Data Lab Login](#login)
* [MyDB, your personal database storage](#mydb)
* [Importing a user table](#import)
* [Run the crossmatch](#crossmatch)
* [Cleanup](#cleanup)

<a class="anchor" id="goals"></a>
# Goals
In this notebook, we demonstrate how to do an efficient crossmatch of a user-provided table of data against a table hosted by Data Lab.

<a class="anchor" id="summary"></a>
# Summary
The basic steps are:
* [Make sure that you are logged in as a registered user](#login)
* [Upload your table into myDB, your personal database storage area](#import)
* [Create and run a query to do the crossmatch using the q3c_join() function](#crossmatch)

<a class="anchor" id="attribution"></a>
# Disclaimer & attribution
If you use this notebook for your published science, please acknowledge the following:

* Data Lab concept paper: Fitzpatrick et al., "The NOAO Data Laboratory: a conceptual overview", SPIE, 9149, 2014, http://dx.doi.org/10.1117/12.2057445

* Data Lab disclaimer: https://datalab.noirlab.edu/disclaimers.php

<a class="anchor" id="login"></a>
# Standard Imports and Data Lab Login

In [2]:
from dl import authClient as ac
from dl import storeClient as sc
from dl import queryClient as qc
from dl.helpers.utils import convert        # to use Pandas
import os
from getpass import getpass

do_cleanup = True                          # Remove any files/tables created by this notebook

# Authentication
Much of the functionality of Data Lab can be accessed without explicitly logging in (the service then uses an anonymous login). But some capacities, for instance saving the results of your queries to your virtual storage space, require a login (i.e. you will need a registered user account).

If you need to log in to Data Lab (you will in order to run this notebook), un-comment the cell below and execute it:

In [3]:
#token = ac.login(input("Enter user name: (+ENTER) "),getpass("Enter password: (+ENTER) "))
ac.whoAmI()

'demo00'

<a class="anchor" id="mydb"></a>
# MyDB, your personal database storage

### Get list of MyDB tables
Let's start by getting a list of existing tables in MyDB. The way to list tables in your MyDB is with the *mydb_list()* method:

        result = queryClient.mydb_list ([token], <table_name>)
where

        token         login token (optional)
        table_name    name of the MyDB table to list (optional)
        
If no arguments are given, a list of all tables in the user MyDB is returned, one tablename per row.  If a table name is provided, the method returns a CSV string on column name and datatype, one column name per row.

In [4]:
print("Listing mydb tables:\n" + qc.mydb_list())

Listing mydb tables:
aaa
aab
basic_result
bgsfaint_dlnotebook
cmtestoutput
cmxmatchtest
desi_tile
df_xmatch
fastspec_everest_z_lt_0p6
fiberassign
gaia_rc
gaia_sample
gaia_sample_xmatch
gals
lowmassagn_dlnotebook
secondary_dark_subset
sv1targets_bright_secondary
sv1targets_dark_secondary
tbl_stat
testcm
testingx
testresult2
testx2
testxmatchqueryout
tile
twomass_gaia1
twomass_pt1
twomasspsc
xmatchasyncout
xmatchasyncout2

### Query database with output to mydb
The most basic way to create a table in mydb is to issue a query against a table in the Data Lab database with output to mydb:

In [5]:
query = 'select top 15 id,raj2000,dej2000 from usno.a2'
try:
    qc.query(adql=query, fmt='csv', out='mydb://usno_objects')
except Exception as e:
    print(e.message)

print("Listing mydb tables:\n" + qc.mydb_list())

Listing mydb tables:
aaa
aab
basic_result
bgsfaint_dlnotebook
cmtestoutput
cmxmatchtest
desi_tile
df_xmatch
fastspec_everest_z_lt_0p6
fiberassign
gaia_rc
gaia_sample
gaia_sample_xmatch
gals
lowmassagn_dlnotebook
secondary_dark_subset
sv1targets_bright_secondary
sv1targets_dark_secondary
tbl_stat
testcm
testingx
testresult2
testx2
testxmatchqueryout
tile
twomass_gaia1
twomass_pt1
twomasspsc
usno_objects
xmatchasyncout
xmatchasyncout2

<a class="anchor" id="import"></a>
# Importing a user table
But often a user will have an existing table that they wish to import into mydb.  The sections below show how to do this with a variety of examples.

### Generate some sample data
First, we'll create a table of data and store it locally as well put in VOSpace.  If you have a table on your local machine, you can use the Jupyter notebook's Upload feature to copy the table into Data Lab.

In [6]:
data = qc.query ('select id,raj2000 as ra,dej2000 as dec from usno.a2 limit 15')  # CSV String
with open ('objects.csv','w') as fd:                                               # file of CSV data
    fd.write (data)   
df = convert(data)                                                                 # Pandas DataFrame
tsv = data.replace(',','\t')                                                       # Tab-separated
asv = data.replace(',',' ')                                                        # ASCII-separated
bsv = data.replace(',','|')                                                        # Bar-separated

if sc.access ('vos://objects.csv'):
    sc.rm ('vos://objects.csv')
if sc.access ('vos://objects.vot'):
    sc.rm ('vos://objects.vot')
sc.put ('objects.csv', 'vos://objects.csv')                                        # Put a copy in VOSpace
print(sc.ls ('objects.*', format='long', verbose=True))

(1 / 1) objects.csv -> vos://objects.csv
-rw-rw-r-x  demo00     528  26 Jul 2023 14:45  objects.csv

We could also have output the result of the query above directly to VOSpace.

In [7]:
query = 'select top 15 id,raj2000,dej2000 from usno.a2'
qc.query(adql=query, fmt='votable', out='vos://objects.vot') # FIXME - query save to existing file fails
print(sc.ls ('objects.*', format='long', verbose=True))

-rw-rw-r-x  demo00     528  26 Jul 2023 14:45  objects.csv
-rw-rw-r-x  demo00    2026  26 Jul 2023 14:45  objects.vot

<a class="anchor" id="import"></a>
### Import a Table Directly to MyDB
The simplest way to import a table to your MyDB is with the *mydb_import()* method:

        result = queryClient.mydb_import ([token], <table_name>, <data> [, schema=<schema_def>])
where

        token         login token (optional)
        table_name    name of the MyDB table to create
        data          filename of CSV data, a CSV string, or a Pandas DataFrame object
        schema_def    [Optional, default=""] The schema definition is stored in a text file or string. 
                      This is a CSV-formatted file that contains column name, (Postgres) data 
                      type, one row per column.
        drop          [Optional, default=True] Drop any existing table before loading the new one.

#### Example 1: Import a (local) CSV file to a MyDB table called 'objects1'

In [8]:
print ('Local file result: '   + qc.mydb_import ('objects1', 'objects.csv'))

Local file result: OK

#### Example 2: Import a CSV file from your Virtual Storage to a MyDB table called 'objects2'

In [9]:
print ('VOS file result: '   + qc.mydb_import ('objects2', 'vos://objects.csv', verbose=True))

15 row(s) imported to mydb_1018."objects2"

VOS file result: OK

#### Example 3:  Import directly from a string containing CSV (or other delimited) data

In [10]:
print ('String (CSV) result: ' + qc.mydb_import ('objects3', data))
#print ('String (TSV) result: ' + qc.mydb_import ('objects3', data, delimiter='\t'))
#print ('String (ASV) result: ' + qc.mydb_import ('objects3', data, delimiter=' '))
#print ('String (BSV) result: ' + qc.mydb_import ('objects3', data, delimiter='|'))

String (CSV) result: OK

#### Example 4: Import a Pandas DataFrame directly to a MyDB table

In [11]:
print ('Pandas result: ' + qc.mydb_import ('objects4', df))

Pandas result: OK

#### Example 5:  Import CSV data, then append to the table

In [12]:
res = qc.mydb_import ('objects5', data, verbose=True)             # Drop existing table by default
print ('Num rows in objects5: ' + qc.query('select count(*) from mydb://objects5',fmt='csv'))

res = qc.mydb_import ('objects5', data, verbose=True, drop=False) # Disable 'drop' to append
print ('Num rows in objects5: ' + qc.query('select count(*) from mydb://objects5',fmt='csv'))

15 row(s) imported to mydb_1018."objects5"

Num rows in objects5: count
15

15 row(s) imported to mydb_1018."objects5"

Num rows in objects5: count
15

#### Example 6:  Import a VOTable stored in Virtual Storage

In [13]:
# Generate a VOTable by calling the PanSTARRS Cone Search service.
ps1_base_url = 'http://gsss.stsci.edu/webservices/vo/ConeSearch.aspx?CAT=PS1V3OBJECTS&'
ps1_url = ps1_base_url + ('RA={0}&DEC={1}&SR={2}'.format(0.0,0.0,0.05))
os.system ('wget -q -O ps1.vot "' + ps1_url + '"')

# Put a copy in virtual storage.
sc.put('ps1.vot',to='vos://ps1.vot')

print (ps1_url)

(1 / 1) ps1.vot -> vos://ps1.vot
http://gsss.stsci.edu/webservices/vo/ConeSearch.aspx?CAT=PS1V3OBJECTS&RA=0.0&DEC=0.0&SR=0.05

Now load the MyDB table directly from the VOTable on local disk, in VOSpace, and directly from the URL:

In [14]:
res = qc.mydb_import ('objects6a', 'ps1.vot', verbose=True)             # Load from local VOTable
print ('import res: ' + res)
print ('Num rows in objects6a: ' + qc.query('select count(*) from mydb://objects6a',fmt='csv'))

253 row(s) imported to mydb_1018."objects6a"

import res: OK
Num rows in objects6a: count
253

In [15]:
res = qc.mydb_import ('objects6b', 'vos://ps1.vot', verbose=True)       # Load from virtual storage VOTable
print ('Num rows in objects6b: ' + qc.query('select count(*) from mydb://objects6b',fmt='csv'))

253 row(s) imported to mydb_1018."objects6b"

Num rows in objects6b: count
253

In [16]:
res = qc.mydb_import ('objects6c', ps1_url, verbose=True)               # Load from service URL directly
print ('Num rows in objects6c: ' + qc.query('select count(*) from mydb://objects6c',fmt='csv'))

253 row(s) imported to mydb_1018."objects6c"

Num rows in objects6c: count
253

Note that for each of the tables created, the column names and data types were determined automatically.  We can check whether these are correct by listing the columns using *mydb_list()*.

In [17]:
print (qc.mydb_list('objects4'))              # Use of the 'mydb://' prefix is optional
print (qc.mydb_list('mydb://objects6a'))

id
ra
dec

objname
objid
ndetections
nstackdetections
ng
nr
ni
nz
ny
objinfoflag
qualityflag
ramean
decmean
rameanerr
decmeanerr
gflags
rflags
iflags
zflags
yflags
gqfperfect
rqfperfect
iqfperfect
zqfperfect
yqfperfect
gmeanpsfmag
gmeanpsfmagerr
gmeanpsfmagnpt
gmeanpsfmagmin
gmeanpsfmagmax
gmeanpsfmagstd
rmeanpsfmag
rmeanpsfmagerr
rmeanpsfmagnpt
rmeanpsfmagmin
rmeanpsfmagmax
rmeanpsfmagstd
imeanpsfmag
imeanpsfmagerr
imeanpsfmagnpt
imeanpsfmagmin
imeanpsfmagmax
imeanpsfmagstd
zmeanpsfmag
zmeanpsfmagerr
zmeanpsfmagnpt
zmeanpsfmagmin
zmeanpsfmagmax
zmeanpsfmagstd
ymeanpsfmag
ymeanpsfmagerr
ymeanpsfmagnpt
ymeanpsfmagmin
ymeanpsfmagmax
ymeanpsfmagstd
gmeanapmag
gmeanapmagerr
gmeanapmagnpt
gmeanapmagstd
rmeanapmag
rmeanapmagerr
rmeanapmagnpt
rmeanapmagstd
imeanapmag
imeanapmagerr
imeanapmagnpt
imeanapmagstd
zmeanapmag
zmeanapmagerr
zmeanapmagnpt
zmeanapmagstd
ymeanapmag
ymeanapmagerr
ymeanapmagnpt
ymeanapmagstd
gmeankronmag
gmeankronmagerr
gmeankronmagnpt
gmeankronmagstd
rmeankronmag
rmeankronmagerr
rmeankronmagnpt
rmeankronmagstd
imeankronmag
imeankronmagerr
imeankronmagnpt
imeankronmagstd
zmeankronmag
zmeankronmagerr
zmeankronmagnpt
zmeankronmagstd
ymeankronmag
ymeankronmagerr
ymeankronmagnpt
ymeankronmagstd
mag
ra
dec
htmid
distance

***
## Piecewise Loading of MyDB Tables

Importing data to MyDB requires two basic steps:  1) Creating the table in the database, and 2) loading the data.  The *mydb_import()* method combines these steps as a convenience but provides additional functionality to automatically convert data formats and derive the table schema.  If you should need to override these steps for some reason, each step can be done individually.

### Create the MyDB table
Creating an empty MyDB table is done with the *mydb_create()* method:

    result = queryClient.mydb_create ([token], <table_name>, <schema_def>)
where

    token         login token (optional)
    table_name    name of the MyDB table to create
    schema_def    filename containing a schema definition, or a string containing the schema definition
    drop          [Optional, default=True] Drop any existing table before loading the new one.
    
The *mydb_create()* step needs a table name (needs to not duplicate an existing myDB table) and a schema definition.  The schema definition is stored in a text file, in this case in the user notebook directory. The schema definition file is a CSV-formatted file that contains column name and (Postgres) data type, one row per column. The token here is optional.

In [18]:
# Create a simple (id,ra,dec) schema of a text string and two double values
schema_str = 'id,text\nra,double precision\ndec,double precision\n'
with open ('schema.txt','w') as fd:
    fd.write (schema_str)

In [19]:
# Example 1:  Create a table from a schema definition file, drop existing table
print("Creating table 'test'... ",qc.mydb_create('test1','schema.txt',drop=True))

Creating table 'test'...  OK

In [20]:
# Example 2:  Create a table from a schema definition str
print("Creating table 'test'... ",qc.mydb_create('test2', schema_str, drop=True))

Creating table 'test'...  OK

In [21]:
print("table1 structure:\n" + qc.mydb_list('test1'))
print("table2 structure:\n" + qc.mydb_list('test2'))

table1 structure:
id
ra
dec

table2 structure:
id
ra
dec

### Insert data 
Loading a MyDB table with data is done with the *mydb_insert()* method:

    result = queryClient.mydb_insert ([token], <table_name>, <data>)
where

    token         login token (optional)
    table_name    name of the MyDB table to load
    data          filename of CSV data or a CSV string
    csv_header    [Optional, default=True] CSV data contains a header row of column names
    
Insert the data from a file/string in user's notebook space to the newly created table in myDB.

In [22]:
# Example 1:  Load from a CSV file
print('Loading from file:   ' + qc.mydb_insert('test1', 'objects.csv'))

# Example 2: Load from a CSV string
print('Loading from string: ' + qc.mydb_insert('test2', data))

Loading from file:   OK
Loading from string: OK

### Retrieve data from myDB table to verify
You can use queryClient to query tables in mydb, exactly as you would for Data Lab database tables.

In [23]:
print("Running query: 'select * from mydb://test1'")
df1=convert(qc.query(sql="select * from mydb://test1"))
df1

Running query: 'select * from mydb://test1'

               id          ra        dec
0   1200-16738677  314.998300  35.267575
1   1200-16737889  314.994803  35.267942
2   1200-16740156  315.005123  35.270559
3   1200-16737180  314.991714  35.269028
4   1200-16736554  314.988739  35.270420
5   1200-16737350  314.992450  35.271870
6   1200-16739707  315.003048  35.273520
7   1200-16742178  315.014253  35.272075
8   1200-16742894  315.017528  35.274592
9   1200-16743776  315.021645  35.275409
10  1200-16743453  315.020131  35.276256
11  1200-16740549  315.006939  35.274864
12  1200-16740499  315.006750  35.279698
13  1200-16742673  315.016534  35.280123
14  1200-16735740  314.985175  35.276403

<a class="anchor" id="crossmatch"></a>
# Run the crossmatch
We now construct a query to run the crossmatch in the database using *q3c_join()*, which identifies all matching objects within a specified radius. (See https://github.com/segasai/q3c for details on using Q3C functions.)  The format is 

        q3c_join (ra_user, dec_user, ra_DLtable, dec_DLtable, radius) 
where it's important that the small user catalog appear FIRST in the query, and the large table from Data Lab database SECOND. The radius is specified in DEGREES.  The user table is referred to using a *mydb://* prefix on the table name. In this example, we parse the result into a Pandas dataframe with the DL helpers module *convert()*.  In the query, we retrieve just the user ID and the object designation from Gaia DR3 along with the separating distance by using the *q3c_dist()* function (and convert the return value in degrees to arcsec).

If you find your q3c_join query runs a long time, check:
* That the ra, dec of the SMALL catalog appears FIRST in the query
* That the radius is in DEGREES, not e.g. arcseconds

(Note that in this notebook, we use a radius of 0.01 degrees or ~36 arcseconds.  It's usually best to start with a smaller radius, especially if you expect a lot of matches.)

In [24]:
%%time

# xmatch query of mydb://objects6a (our small PS1 table) against gaia_dr3.gaia_source within 0.01 degrees, return all matches
sql = '''SELECT  o.objid, g.designation,
                (q3c_dist(o.ramean,o.decmean,g.ra,g.dec)*3600.0) as dist_arcsec
         FROM mydb://objects6a AS o, 
              gaia_dr3.gaia_source AS g 
         WHERE q3c_join(o.ramean, o.decmean, g.ra, g.dec, 0.01)'''
df2 = convert(qc.query(sql=sql))

CPU times: user 25.9 ms, sys: 3.84 ms, total: 29.7 ms
Wall time: 152 ms

In [25]:
print ('nrows x ncols: ' + str(df2.shape))
df2[0:10] # first 10 rows, note multiple matches

nrows x ncols: (210, 3)

                objid                   designation  dist_arcsec
0  108000000004132800  Gaia DR3 2546034966433885568    33.644098
1  107990000018985382  Gaia DR3 2546034966433885568    29.641774
2  107990000054816431  Gaia DR3 2546034966433885568    16.739560
3  107990000094369406  Gaia DR3 2546034966433885568     0.024728
4  108013599948120838  Gaia DR3 2738188646457069696    22.856130
5  108000000093455743  Gaia DR3 2546034966433885568    19.168215
6  108000000105384460  Gaia DR3 2546034966433885568    15.916200
7  108003599898938079  Gaia DR3 2642111838657303808    35.941535
8  108003599898938079  Gaia DR3 2738188646457069696    21.190770
9  108003599869045137  Gaia DR3 2642111735577925376    34.998654

Note again that this query returns *__all__* matches within the radius for each object in list.  The crossmatch query can be written to other result tables such as only the nearest neighbor, only those objects in the user table that have matches, non-matches (i.e. objects with no match the find catalog dropouts), or it can be used to pre-filter either table (e.g. only match 'red' objects with a stellar profile).  The Q3C documentation (see https://github.com/segasai/q3c) contains additional example queries you can try.

__Want to do just a nearest neighbor search?__  This example adapted from the Q3C documentation picks just the nearest neighbor, returning null if none are found:

In [26]:
%%time

sql = '''SELECT  o.objid, gg.designation, (q3c_dist(o.ramean,o.decmean,gg.ra,gg.dec)*3600.0) as dist_arcsec 
         FROM mydb://objects6a AS o
         LEFT JOIN LATERAL (
               SELECT g.* 
                    FROM 
                        gaia_dr3.gaia_source AS g
                    WHERE
                        q3c_join(o.ramean, o.decmean, g.ra, g.dec, 0.01)
                    ORDER BY
                        q3c_dist(o.ramean,o.decmean,g.ra,g.dec)
                    ASC LIMIT 1
               ) as gg ON true'''

df3 = convert(qc.query(sql=sql))

CPU times: user 22.7 ms, sys: 4.62 ms, total: 27.3 ms
Wall time: 150 ms

In [27]:
print ('nrows x ncols: ' + str(df3.shape))
df3[0:10] # first 10 rows

nrows x ncols: (253, 3)

                objid                   designation  dist_arcsec
0  108000000004132800  Gaia DR3 2546034966433885568    33.644098
1  108003599979874881                           NaN          NaN
2  107990000018985382  Gaia DR3 2546034966433885568    29.641774
3  107990000054816431  Gaia DR3 2546034966433885568    16.739560
4  107990000094369406  Gaia DR3 2546034966433885568     0.024728
5  107983599973919166                           NaN          NaN
6  108013599996822453                           NaN          NaN
7  108013599948120838  Gaia DR3 2738188646457069696    22.856130
8  108000000093455743  Gaia DR3 2546034966433885568    19.168215
9  108000000105384460  Gaia DR3 2546034966433885568    15.916200

__Don't want the non-matching rows?__  Just replace the LEFT JOIN above with an INNER JOIN:

In [28]:
%%time

sql = '''SELECT  o.objid, gg.designation, (q3c_dist(o.ramean,o.decmean,gg.ra,gg.dec)*3600.0) as dist_arcsec 
         FROM mydb://objects6a AS o
         INNER JOIN LATERAL (
               SELECT g.* 
                    FROM 
                        gaia_dr3.gaia_source AS g
                    WHERE
                        q3c_join(o.ramean, o.decmean, g.ra, g.dec, 0.01)
                    ORDER BY
                        q3c_dist(o.ramean,o.decmean,g.ra,g.dec)
                    ASC LIMIT 1
               ) as gg ON true'''

df4 = convert(qc.query(sql=sql))

CPU times: user 26.6 ms, sys: 1.55 ms, total: 28.1 ms
Wall time: 151 ms

In [29]:
print ('nrows x ncols: ' + str(df4.shape))
df4[0:10] # first 10 rows

nrows x ncols: (132, 3)

                objid                   designation  dist_arcsec
0  108000000004132800  Gaia DR3 2546034966433885568    33.644098
1  107990000018985382  Gaia DR3 2546034966433885568    29.641774
2  107990000054816431  Gaia DR3 2546034966433885568    16.739560
3  107990000094369406  Gaia DR3 2546034966433885568     0.024728
4  108013599948120838  Gaia DR3 2738188646457069696    22.856130
5  108000000093455743  Gaia DR3 2546034966433885568    19.168215
6  108000000105384460  Gaia DR3 2546034966433885568    15.916200
7  108003599898938079  Gaia DR3 2738188646457069696    21.190770
8  108003599869045137  Gaia DR3 2642111838657303808    28.265715
9  107990000145388611  Gaia DR3 2546034966433885568    18.547336

<a class="anchor" id="cleanup"></a>
# Cleanup
If the myDB table was meant to be temporary, it can be dropped with *mydb_drop()*.  Here, we'll drop only the tables created in this notebook:

In [30]:
# Drop any tables or temp files we created.
if do_cleanup:
    for table in ['test1','test2','objects1','objects2','objects3','objects4','objects5','objects6a','objects6b','objects6c']:
        print("Dropping table '" + table + "' ... \t" + qc.mydb_drop(table))
    print("Listing mydb tables:\n" + qc.mydb_list())
    
    for f in ['objects.csv','schema.txt']:
        if os.path.exists(f):
            os.remove (f)
    if sc.access ('vos://objects.csv'):
        print ('removing objects.csv')
        sc.rm ('vos://objects.csv')
    if sc.access ('vos://objects.vot'):
        print ('removing objects.vot')
        sc.rm ('vos://objects.vot')

Dropping table 'test1' ... 	OK
Dropping table 'test2' ... 	OK
Dropping table 'objects1' ... 	OK
Dropping table 'objects2' ... 	OK
Dropping table 'objects3' ... 	OK
Dropping table 'objects4' ... 	OK
Dropping table 'objects5' ... 	OK
Dropping table 'objects6a' ... 	OK
Dropping table 'objects6b' ... 	OK
Dropping table 'objects6c' ... 	OK
Listing mydb tables:
aaa
aab
basic_result
bgsfaint_dlnotebook
cmtestoutput
cmxmatchtest
desi_tile
df_xmatch
fastspec_everest_z_lt_0p6
fiberassign
gaia_rc
gaia_sample
gaia_sample_xmatch
gals
lowmassagn_dlnotebook
secondary_dark_subset
sv1targets_bright_secondary
sv1targets_dark_secondary
tbl_stat
testcm
testingx
testresult2
testx2
testxmatchqueryout
tile
twomass_gaia1
twomass_pt1
twomasspsc
usno_objects
xmatchasyncout
xmatchasyncout2

removing objects.csv
removing objects.vot

If instead you want to drop __all__ tables in your MyDB, you can do this by processing the list, e.g.

In [31]:
if False:      # CAUTION! Change this to 'if True' to remove all tables
    print("Initial listing of mydb tables:\n" + qc.mydb_list())
    table_list = qc.list().split('\n')    # convert string return to array
    for table in table_list:
        print("Dropping table '" + table + "' ... \t" + qc.mydb_drop(table))
    print("\nFinal listing of mydb tables:\n" + qc.mydb_list())
    print("\nFinal list of VOSpace:\n" + sc.ls(format='long'))